{
  "releases": [
    {
      "version": "3.1.1",
      "notes": [
        "Added:  The welcome page with release notes will now open up whenever a new version is released.",
        "Fixed:  Automatic cleaning on Google Chrome.",
        "Changed:  Some minor CSS formatting on the sidemenu in settings.  Make PayPal Link fall in line with the othe menu items.",
        "Updated:  Third-Party Dependencies (React and React-dom to 16.13.1)",
      ],
    },
    {
      "version": "3.1.0",
      "notes": [
        "Added:  Webextension Title and Version to popup.",
        "Added:  BrowserAction Title now also contains the number of cookies for that domain in square brackets.  This is more helpful in Firefox mobile to see the amount of cookies there are.",
        "Added:  Cookie Count is now listed inside the popup as well.",
        "Added:  Crowdin Integration.  Previously it was manually compiled.",
        "Added:  Regular Expression usage!  Thanks to maltsev PR#649.  Regular Expression must start and end with '/'. **WARNING:  Cookies with same name on different domain/sites will ALL be treated the same!**",
        "Added:  A \"Menu\" string below the hamburger icon.  The menu button itself is now expanded to the entire top of the screen.",
        "Changed:  (Dev Build Changes) Webpack will now copy jQuery, bootstrap, and browser-polyfill js and css from their npm dist folders.  Previously was manually updated.",
        "Changed:  Locale strings.  This would technically fix the version number in notification titles that may not have been shown in certain locales.",
        "Chore:  Updated copyright year, added GitHub Contributors and License links in most source code headers",
        "Fixed:  Cookie Badge Count should now reflect an accurate cookie count when cookies are added/removed.  This includes cookies removed manually or by CAD.",
        "Fixed:  A Cookie List Bug due to Regular Expression Usage.",
        "Fixed:  Multiple expressions using comma-separated values are now supported in new expression textbox AND in Import Expressions.  Fixes #567.",
        "Updated:  The usual third-party dependency updates.",
        "Updated:  Per Webpack configuration update, latest minified versions of Bootstrap v4.4.1, browser-polfill (webextension-polyfill) v0.6.0, jQuery 3.4.1 (the bundle version with popper.js).",
        "Updated:  (Dev Test) jest v25.1.0, @types/jest v25.1.4, ts-jest v25.2.1, tslint 6.1.0.",
        "Updated:  Minor CSS styling change in the Expression Table in settings.",
        "Translator Notice:  Crowdin now has the latest additions and modifications.  If any translation strings aren't looking good, please check and update any translations accordingly through Crowdin."
      ]
    },
    {
      "version": "3.0.4",
      "notes": [
        "Fixed:  IP Regex Bug #539.",
        "Added:  Documentation and FAQ links to About Page, along with its Locale Additions.  This was based on PR #240 for the 2.X.X Branch.",
        "Added:  CAD Badge count should no longer include the cookie that CAD creates to cleanup localstorage.  Per #611.",
        "Changed:  Welcome Page should now only show the last 5 version change logs.",
        "Updated:  Dependency Updates"
      ]
    },
    {
      "version": "3.0.3",
      "notes": [
        "Updated:  Third-Party dependencies.",
        "Fixed:  Bugs due to third-party dependency updates."
      ]
    },
    {
      "version": "3.0.2",
      "notes": [
        "Added: Version Number to some UI elements",
        "Added: Timezone to cleanup log timestamps",
        "Fixed: Notifications not showing up with Localstorage cleanup in Firefox 57 and higher"
      ]
    },
    {
      "version": "3.0.1",
      "notes": [
        "Added: A Fallback error message and actions for when the extension data is corrupted in the settings or popup",
        "Fixed: Cookie/Localstorage Cleanup relating to blank hostnames",
        "Fixed: White/Grey listing IPv6 sites",
        "Disabled: Localstorage cleanup on Firefox Android"
      ]
    },
    {
      "version": "3.0.0",
      "notes": [
        "Added: Ability to keep individual cookies or localstorage per expression",
        "Added: Ability to restore cookies after a cleanup",
        "Added: Better indication of a failed cleanup in the form of a notification",
        "Changed: Reduced final build size by over 65%",
        "Changed: Prevent startup cleanup on an extension update",
        "Fixed: Black font on badge text",
        "Removed: Migration code from 1.X.X to 2.X.X"
      ]
    },
    {
      "version": "2.2.0",
      "notes": [
        "Added: Cleanup Log, gives the decision taken (Keep or Clean) for every site and the reasons why after cleanup",
        "Added: Setting for activating cleanup on domain change in the same tab",
        "Added: Proper support for cleaning private mode cookies",
        "Fixed: Rare bug where deleting an expression wouldn't be deleted"
      ]
    },
    {
      "version": "2.1.0",
      "notes": [
        "Added: Localstorage Support (Firefox 58+, BrowserData API requested)",
        "Added: First Party Isolation Support (Firefox 59+, Privacy API requested)",
        "Added: Notification on-screen timer setting",
        "Added: Notification quick toggle in the popup",
        "Fixed: Cookies not deleting for newly created Containers",
        "Fixed: Cookies not deleting until a second tab close under no delay",
        "Changed: Condensed popup actions",
        "Changed: Delay timer changed from minutes to seconds",
        "Changed (2.1.1): Mobile Settings UI Improvements",
        "Changed (2.1.1): 'Restore Default Settings' now only affects the Settings Page",
        "Fixed (2.1.2): Popup UI Glitches",
        "Fixed (2.1.2): Add a random path ID to localstorage cookie to prevent fingerprinting"
      ]
    },
    {
      "version": "2.0.0",
      "notes": [
        "Changed: Under the hood improvements with React/Redux. Your settings and Domain list will be migrated automatically on update. Old settings are still kept.",
        "Changed: Changed Strict String Matching to Expression Matching. Now you can use wildcards in your domains like git*b.com to match github.com and gitlab.com",
        "Changed: UI Refresh with BootStrap",
        "Changed: The old exported Domains are not compatible anymore with 2.X.X since there is an entirely different (better) storage format.",
        "Fixed (2.0.1): Startup cleanup occurring even when Active Mode is disabled",
        "Fixed (2.0.1): Popup reflow bugs",
        "Changed (2.0.1): Some slight UI visual changes due to Bootstrap upgrade from 3 to 4"
      ]
    },
    {
      "version": "1.4.0",
      "notes": [
        "New Feature: GreyList Support (Set a site's cookies to clear on browser restart)",
        "Added: Global Subdomain Checkbox",
        "Changed: WhiteList and GreyList are now Sorted",
        "Fixed (1.4.1): Edited txt files would break import under different EOL",
        "New Language (1.4.1): sv",
        "New Language (1.4.2): sr",
        "Fixed (1.4.2): Cookie Cleanup failing on cookies without hostnames",
        "New Language (1.4.3): pt_BR",
        "New Language (1.4.3): zh_ZW"
      ]
    },
    {
      "version": "1.3.0",
      "notes": [
        "New Feature: Option to do a Cookie Cleanup on Startup",
        "New Feature: Whitelist Subdomain Support (The icon will tell you if a site is protected or not)",
        "Fixed delay timer in settings not saving for certain locales with different decimals",
        "New Languages: bg, de, fr, zh_CN"
      ]
    },
    {
      "version": "1.2.0",
      "notes": [
        "New Feature: Cookie Cleanup (Ignore Open Tabs) in popup menu. This lets you clear cookies based on the WhiteList alone.",
        "Added Localization Support. Instructions to translate Cookie AutoDelete are on GitHub Page",
        "New Languages: pt_PT, es"
      ]
    },
    {
      "version": "1.1.0",
      "notes": [
        "Can now access the popup in pages that are not webpages",
        "New Feature: Background of the icon color changes whether a site is in the whitelist"
      ]
    },
    {
      "version": "1.0.0",
      "notes": [
        "Auto Deletes Cookies from Closed Tabs",
        "WhiteList Support for Sites you want to keep Cookies",
        "Easily Export/Import your Whitelist",
        "Clear All Cookies for a Domain",
        "(1.0.2) Fixed Cookie Cleanup not activating from Background Services",
        "(1.0.2) Added link to Firefox and Chrome extension pages",
        "(1.0.3) Fixed Cookie Cleanup not activating if a tab had an IP address URL"
      ]
    }
  ]
}
