{
  "releases": [
    {
      "version": "3.6.0",
      "notes": [
        "Added:  Implementation of FireFox Containers/Contextual Identities.  This allows CAD to monitor when changes to containers info have been made, and remove the CAD list matching that removed container ID.",
        "Added:  Manually entering expressions and using Shift+Enter will add the expression into the GreyList.",
        "Added:  Search Expressions while typing.  It's not perfect but it is a start.  Closes #120.",
        "Added:  IP CIDR Notation in Expressions.  Closes #814.",
        "Chore:  Backend Code Optimizations.",
        "Chore:  Dependency Updates.",
        "Fixed:  Duplication of domains in siteData Notifications.",
        "Fixed:  Additional cleanup popup 'flashing' in certain situations.  Closes #803.",
        "Fixed:  Usage of commas within Regular Expressions.  Closes #865.",
        "Fixed:  Partial Regex Domain Replacements in backend."
      ]
    },
    {
      "version": "3.5.1",
      "notes": [
        "Fixed:  browsingData cleanup.  Remove Internal CAD Cookie from notifications and cleanup logs.  Closes #846.",
        "Fixed:  LocalStorage should not be fully cleaned if migrating from 3.4.0.  Closes #847.",
        "Fixed:  Cookie Count and Icon in Firefox non-FirstPartyIsolation mode.  Closes #839.",
        "Fixed:  Documentation Links.  Closes #840"
      ]
    },
    {
      "version": "3.5.0",
      "notes": [
        "MIGRATION NOTE 1:  'Uncheck Keep Localstorage on new expressions' has been deprecated in favor of default expression entries.  Those that have this enabled will see new default expression entries for all containers for that list type.  Only the localStorage option in the global default expression entry will be downgraded for use in 3.4.0!",
        "MIGRATION NOTE 2:  'LocalStorage Cleanup' setting has its internal naming changed to be consistent with other new site data cleanup types.  Its value have been migrated, and should persist when downgrading back to 3.4.0.",
        "Added:  Cleanup of additional site data types by hostname.  For backwards compatibility, existing rules will be keeping all newly implemented site data types.  Closes #792 (Plugin Data-Firefox 78+ and Chrome), #551 (Cache-Firefox 77+ and Chrome), #287 (Service Workers-Firefox 77+ and Chrome), #283 (ETag/Cache), #264 (Flash Cookies/Plugin Data) #171 (indexedDB-Firefox 77+ and Chrome))",
        "Added:  Default Expression Options has an upgrade.  It is now customizable per container!  See https://github.com/Cookie-AutoDelete/Cookie-AutoDelete/wiki/Documentation#default-expression-options or start in List of Expressions.",
        "Added:  Cleanup of Expired Cookies regardless of lists.  Closes #344.",
        "Added:  Clear Cookie Counter function.  Will only clear counters and not activity log.  Added as enhancement from #777",
        "Added:  Notifications about Site Data (Attempted) Cleaning after automatic cleaning.",
        "Added:  Activity Log now shows the attempted removal of site data type of domain(s).",
        "Added:  Remove Individual Activity Log Entry.",
        "Added:  Container Display Names to Activity Log Entries.",
        "Added:  Display Container ID for selected/active expression list.",
        "Added:  Ability to remove all expressions from one list.",
        "Added:  Lists stored in CAD that don't have a matching Firefox container will now show as invalid container in Red Text.",
        "Added:  Option to show manual notifications (clean site data for a domain actions).  Closes #779",
        "Added:  Firefox's FirstPartyIsolation enhancements.  This accommodates the new way that firefox sets its firstPartyDomain in cookies.  This also allows cookies previously created with firstPartyIsolation enabled to be removed in non-firstPartyIsolation mode.  Per #801",
        "Changed:  Minor CSS Styling on Clean button + dropdown.  Enhanced based on PR#793.",
        "Fixed:  Clearing Logs will not affect cookie counters anymore.  Closes #777.",
        "Fixed:  Clean delay textbox was not wide enough to fit the max number.  Closes #822",
        "Fixed:  A setting link wasn't linked accurately.  Thanks to szpak per PR#797.",
        "Updated:  Translations from Crowdin."
      ]
    },
    {
      "version": "3.4.0",
      "notes": [
        "Added:  Workaround for Firefox's First Party Isolation Check without using the 'privacy' permission in Firefox.  This removes the 'privacy' permission, thus one less permission to deal with.  This also allows the cleanup actions to query for FirstPartyIsolate rather than only at browser startup.",
        "Added:  Opening Setting from Popup now opens in a new tab next to the active one.",
        "Added:  Right-Click Support for Link, Page, and text selection.  Per #717. This would be the solution to #521 in regards to selection-right-click.",
        "Added:  Option to clean data from discarded tabs.  Per #720/#721.",
        "Changed:  cleanDataForThisDomain functions received an enhancement to display notification and show removal count.  Closes #386.",
        "Changed:  Expression Input type is now 'url' instead of 'text'.  Purely for mobile software keyboards so that dots aren't periods and add a space where it is not needed.",
        "Changed:  Truncated favIconUrl and cookie value values on debug outputs.",
        "Enhanced:  Unit Tests for CleanupService.",
        "Fixed:  Open Tabs now take containers into consideration, so domains from open tabs should not affect cleaning those domains in another container now.  Closes #716, #262, and other related ones.",
        "Fixed:  Internal Icons are now hidden as they cannot be shown (favIconUrl starting with 'chrome:'). This hides the error shown in console.",
        "Fixed:  Greyscale Icon now shows up at browser startup.",
        "Fixed:  CAD no longer removes items from containers if container cleaning is not enabled.  Closes #746.",
        "Fixed:  Cookie names starting with __Host- or __Secure- may not have been restored correctly.  Closes #772.",
        "Updated:  Translations from Crowdin."
      ]
    },
    {
      "version": "3.3.1",
      "notes": [
        "Fixed regression of icon colors from 3.3.0.  Closes #733",
        "Added the ability to choose font size for popup and settings.  Closes #736, #598, #593, and possibly #358",
        "Help icon for each setting is an actual icon now."
      ]
    },
    {
      "version": "3.3.0",
      "notes": [
        "Minor breaking change 1:  Exporting data to file is now done in a function so that it can be reused elsewhere (e.g. Settings Page). No more right-click to download.  This also hides the link that is shown at the bottom-left on mouseover.",
        "Minor breaking change 2:  Some translation strings were modified (mostly in settings) and will need translations again.",
        "Added:  More unit testing for functions.",
        "Added:  Debug Logging  (excludes Firefox Android).  This goes to the browser extension console and is for advanced users.",
        "Added:  Core Settings Import/Export.  This will stay as a seprate file from Expressions for now. Closes #429",
        "Added:  Settings Validation again after each setting change.",
        "Added:  Cleanup on Browser Restart (GreyList) can be disabled.  Closes #463.",
        "Added:  If the browser crashed / a tab `about:sessionrestore` (Firefox) is part of the opened tabs, then greylist cleanup will not run. Closes #463.",
        "Added:  Delete All Expressions Button in Settings->Expressions.  This action cannot be undone so make sure you have exported a backup first! Closes #712.",
        "Added:  Cookies (not localstorage) created by local html files can now be cleared through expressions.  Make sure to include 'file://' for local files.",
        "Added:  A note about cleanup logs not generated for tabs in Private Browsing.",
        "Added:  BrowserAction Title now includes the list type if the domain matches an expression",
        "Added:  Keep Default Icon option (i.e. no red or yellow icons). If cookie count in icon is disabled, this is also disabled. Closes #76.",
        "Added:  Greyscale Icon if autoclean is disabled.  BrowserAction Title will show 'DISABLED' instead of matching WHITE/GREY list.  Closes #454.",
        "Added:  Small Accessibility enhancements in regards to the checkboxes.  Using role='checkbox' and aria-checked as well as linking labels to their inputs.  Closes #610 for now.",
        "Added:  Small warning in popup's additional cleanup options for the last two cleanup items.",
        "Changed:  CSS Buttons in Expression Table to be more colorful.",
        "Changed:  Attempted to remove unused CSS entries.",
        "Changed:  Top menu bar will only show up for browser width up to 1024px now.  Closes #714",
        "Changed:  Some minor optimization of backend code for Settings and Expressions",
        "Changed:  Reorganized the CAD Settings page.",
        "Chore:  Reorganized the properties in each CSS item in order.",
        "Fixed:  Minimum cleanup delay to 1 second and max cleanup delay to 2147483 seconds (setTimeout limitations).",
        "Fixed:  Domains accessed with a dot in the end will also be cleared.  This will not affect existing expressions so new ones will need to be created for domains ending in a dot.  Closes #701.",
        "Fixed:  Another attempt at blindly cleaning localstorage.  Cookies from 'sub.domain.com' will also clean localstorage from 'www.sub.domain.com' and '.sub.domain.com'.  Possibly closes #699 and others.",
        "Fixed:  Localstorage cleanup on startup. Closes #700, #581.",
        "Fixed:  CSS Styling for UI Buttons in Expressions To make it side by side.  Closes #399.",
        "Fixed:  Texts in Firefox Popup not selectable.  Closes #622.",
        "Fixed:  More checks for functions unavailable on Firefox Android.",
        "Fixed:  Cookies in default container may not be cleared if no tabs on default container is open.  Closes #625.",
        "Fixed:  Navigating to about:newtab / about:blank / about:home from another domain will trigger cleanup now, as long as clean on Domain Change is enabled.  Closes #459."
      ]
    },
    {
      "version": "3.2.0",
      "notes": [
        "Added:  LocalStorage Cleaning for Google Chrome!  Minimum Chrome Version is now 74 for cleaning by hostname.",
        "Added:  Option to disable new version popup.  Per Feature Request #661.  Further discussions resulted up being an 'opt-in to enable' feature.",
        "Added:  New Tab Popup to the Welcome/Release Notes once on new installations.",
        "Added:  Option to have 'Keep LocalStorage' unchecked as default for new expressions.  Per Feature Request #561.",
        "Added:  A warning in settings if LocalStorage is currently disabled so that users know that all LocalStorage will be cleared upon enabling that setting.  The warning was previously only seen online on the Documentation on GitHub.",
        "Added: Settings Validation Checks to disable some feature/settings that are unusable depending on browser environment (e.g. Chrome, Android)",
        "Changed:  CSS for top menu in settings.  The icon is now centered even after the sidemenu appears.",
        "Changed:  Settings Tooltip links now more streamlined in backend (Internal changes - shouldn't affect anyone).",
        "Changed:  Wording on using both LocalStorage Cleanup and Containers (Firefox).",
        "Fixed:  High CPU Usage due to cookie count in popup introduced in 3.1.0",
        "Removed:  Regeneration of setting ID after each update. (Internal stuff - shouldn't affect anyone.)",
        "Updated:  Crowdin Translations.  Some translations on Crowdin require changing as the meaning was clarified.  Please update accordingly.",
        "Updated:  Third-Party Dependencies"
      ]
    },
    {
      "version": "3.1.1",
      "notes": [
        "Added:  The welcome page with release notes will now open up whenever a new version is released.",
        "Fixed:  Automatic cleaning on Google Chrome.",
        "Changed:  Some minor CSS formatting on the sidemenu in settings.  Make PayPal Link fall in line with the othe menu items.",
        "Updated:  Third-Party Dependencies (React and React-dom to 16.13.1)"
      ]
    },
    {
      "version": "3.1.0",
      "notes": [
        "Added:  Webextension Title and Version to popup.",
        "Added:  BrowserAction Title now also contains the number of cookies for that domain in square brackets.  This is more helpful in Firefox mobile to see the amount of cookies there are.",
        "Added:  Cookie Count is now listed inside the popup as well.",
        "Added:  Crowdin Integration.  Previously it was manually compiled.",
        "Added:  Regular Expression usage!  Thanks to maltsev PR#649.  Regular Expression must start and end with '/'. **WARNING:  Cookies with same name on different domain/sites will ALL be treated the same!**",
        "Added:  A \"Menu\" string below the hamburger icon.  The menu button itself is now expanded to the entire top of the screen.",
        "Changed:  (Dev Build Changes) Webpack will now copy jQuery, bootstrap, and browser-polyfill js and css from their npm dist folders.  Previously was manually updated.",
        "Changed:  Locale strings.  This would technically fix the version number in notification titles that may not have been shown in certain locales.",
        "Chore:  Updated copyright year, added GitHub Contributors and License links in most source code headers",
        "Fixed:  Cookie Badge Count should now reflect an accurate cookie count when cookies are added/removed.  This includes cookies removed manually or by CAD.",
        "Fixed:  A Cookie List Bug due to Regular Expression Usage.",
        "Fixed:  Multiple expressions using comma-separated values are now supported in new expression textbox AND in Import Expressions.  Fixes #567.",
        "Updated:  The usual third-party dependency updates.",
        "Updated:  Per Webpack configuration update, latest minified versions of Bootstrap v4.4.1, browser-polfill (webextension-polyfill) v0.6.0, jQuery 3.4.1 (the bundle version with popper.js).",
        "Updated:  (Dev Test) jest v25.1.0, @types/jest v25.1.4, ts-jest v25.2.1, tslint 6.1.0.",
        "Updated:  Minor CSS styling change in the Expression Table in settings.",
        "Translator Notice:  Crowdin now has the latest additions and modifications.  If any translation strings aren't looking good, please check and update any translations accordingly through Crowdin."
      ]
    },
    {
      "version": "3.0.4",
      "notes": [
        "Fixed:  IP Regex Bug #539.",
        "Added:  Documentation and FAQ links to About Page, along with its Locale Additions.  This was based on PR #240 for the 2.X.X Branch.",
        "Added:  CAD Badge count should no longer include the cookie that CAD creates to cleanup localstorage.  Per #611.",
        "Changed:  Welcome Page should now only show the last 5 version change logs.",
        "Updated:  Dependency Updates"
      ]
    },
    {
      "version": "3.0.3",
      "notes": [
        "Updated:  Third-Party dependencies.",
        "Fixed:  Bugs due to third-party dependency updates."
      ]
    },
    {
      "version": "3.0.2",
      "notes": [
        "Added: Version Number to some UI elements",
        "Added: Timezone to cleanup log timestamps",
        "Fixed: Notifications not showing up with Localstorage cleanup in Firefox 57 and higher"
      ]
    },
    {
      "version": "3.0.1",
      "notes": [
        "Added: A Fallback error message and actions for when the extension data is corrupted in the settings or popup",
        "Fixed: Cookie/Localstorage Cleanup relating to blank hostnames",
        "Fixed: White/Grey listing IPv6 sites",
        "Disabled: Localstorage cleanup on Firefox Android"
      ]
    },
    {
      "version": "3.0.0",
      "notes": [
        "Added: Ability to keep individual cookies or localstorage per expression",
        "Added: Ability to restore cookies after a cleanup",
        "Added: Better indication of a failed cleanup in the form of a notification",
        "Changed: Reduced final build size by over 65%",
        "Changed: Prevent startup cleanup on an extension update",
        "Fixed: Black font on badge text",
        "Removed: Migration code from 1.X.X to 2.X.X"
      ]
    },
    {
      "version": "2.2.0",
      "notes": [
        "Added: Cleanup Log, gives the decision taken (Keep or Clean) for every site and the reasons why after cleanup",
        "Added: Setting for activating cleanup on domain change in the same tab",
        "Added: Proper support for cleaning private mode cookies",
        "Fixed: Rare bug where deleting an expression wouldn't be deleted"
      ]
    },
    {
      "version": "2.1.0",
      "notes": [
        "Added: Localstorage Support (Firefox 58+, BrowserData API requested)",
        "Added: First Party Isolation Support (Firefox 59+, Privacy API requested)",
        "Added: Notification on-screen timer setting",
        "Added: Notification quick toggle in the popup",
        "Fixed: Cookies not deleting for newly created Containers",
        "Fixed: Cookies not deleting until a second tab close under no delay",
        "Changed: Condensed popup actions",
        "Changed: Delay timer changed from minutes to seconds",
        "Changed (2.1.1): Mobile Settings UI Improvements",
        "Changed (2.1.1): 'Restore Default Settings' now only affects the Settings Page",
        "Fixed (2.1.2): Popup UI Glitches",
        "Fixed (2.1.2): Add a random path ID to localstorage cookie to prevent fingerprinting"
      ]
    },
    {
      "version": "2.0.0",
      "notes": [
        "Changed: Under the hood improvements with React/Redux. Your settings and Domain list will be migrated automatically on update. Old settings are still kept.",
        "Changed: Changed Strict String Matching to Expression Matching. Now you can use wildcards in your domains like git*b.com to match github.com and gitlab.com",
        "Changed: UI Refresh with BootStrap",
        "Changed: The old exported Domains are not compatible anymore with 2.X.X since there is an entirely different (better) storage format.",
        "Fixed (2.0.1): Startup cleanup occurring even when Active Mode is disabled",
        "Fixed (2.0.1): Popup reflow bugs",
        "Changed (2.0.1): Some slight UI visual changes due to Bootstrap upgrade from 3 to 4"
      ]
    },
    {
      "version": "1.4.0",
      "notes": [
        "New Feature: GreyList Support (Set a site's cookies to clear on browser restart)",
        "Added: Global Subdomain Checkbox",
        "Changed: WhiteList and GreyList are now Sorted",
        "Fixed (1.4.1): Edited txt files would break import under different EOL",
        "New Language (1.4.1): sv",
        "New Language (1.4.2): sr",
        "Fixed (1.4.2): Cookie Cleanup failing on cookies without hostnames",
        "New Language (1.4.3): pt_BR",
        "New Language (1.4.3): zh_ZW"
      ]
    },
    {
      "version": "1.3.0",
      "notes": [
        "New Feature: Option to do a Cookie Cleanup on Startup",
        "New Feature: Whitelist Subdomain Support (The icon will tell you if a site is protected or not)",
        "Fixed delay timer in settings not saving for certain locales with different decimals",
        "New Languages: bg, de, fr, zh_CN"
      ]
    },
    {
      "version": "1.2.0",
      "notes": [
        "New Feature: Cookie Cleanup (Ignore Open Tabs) in popup menu. This lets you clear cookies based on the WhiteList alone.",
        "Added Localization Support. Instructions to translate Cookie AutoDelete are on GitHub Page",
        "New Languages: pt_PT, es"
      ]
    },
    {
      "version": "1.1.0",
      "notes": [
        "Can now access the popup in pages that are not webpages",
        "New Feature: Background of the icon color changes whether a site is in the whitelist"
      ]
    },
    {
      "version": "1.0.0",
      "notes": [
        "Auto Deletes Cookies from Closed Tabs",
        "WhiteList Support for Sites you want to keep Cookies",
        "Easily Export/Import your Whitelist",
        "Clear All Cookies for a Domain",
        "(1.0.2) Fixed Cookie Cleanup not activating from Background Services",
        "(1.0.2) Added link to Firefox and Chrome extension pages",
        "(1.0.3) Fixed Cookie Cleanup not activating if a tab had an IP address URL"
      ]
    }
  ]
}
